// 書籍のカテゴリ別に件数及び書籍名一覧を取得
db.books.aggregate([{
    $unwind: "$categories"
}, {
    $group: {
        _id: "$categories",
        count:{$sum: 1},
        books: {$push: "$title"}
    }
}])

/*
{ "_id" : "演劇・舞台", "count" : 1, "books" : [ "父帰る" ] }
{ "_id" : "詩集", "count" : 1, "books" : [ "歌よみに与ふる書" ] }
{ "_id" : "推理小説", "count" : 2, "books" : [ "怪人二十面相", "少年探偵団" ] }
{ "_id" : "日本文学", "count" : 14, "books" : [ "羅生門", "蜘蛛の糸", "或阿呆の一生", "河童", "歯車", "忠直卿行状記", "吾輩は猫である", "坊っちゃん", "三四郎", "門", "にごりえ", "たけくらべ", "十三夜", "わか 
れ道" ] }
{ "_id" : "ミステリー・サスペンス・ハードボイルド", "count" : 1, "books" : [ "D坂の殺人事件" ] }
{ "_id" : "文学・評論", "count" : 15, "books" : [ "D坂の殺人事件", "怪人二十面相", "少年探偵団", "父帰る", "忠直卿行状記", "吾輩は猫である", "坊っちゃん", "三四郎", "門", "にごりえ", "たけくらべ", "十三夜", "わかれ道", "歌よみに与ふる書", "みだれ髪" ] }
{ "_id" : "文芸作品", "count" : 14, "books" : [ "羅生門", "蜘蛛の糸", "或阿呆の一生", "河童", "歯車", "忠直卿行状記", "吾輩は猫である", "坊っちゃん", "三四郎", "門", "にごりえ", "たけくらべ", "十三夜", "わか 
れ道" ] }
{ "_id" : "評論・文学研究", "count" : 1, "books" : [ "歌よみに与ふる書" ] }
{ "_id" : "歌集", "count" : 1, "books" : [ "みだれ髪" ] }
{ "_id" : "戯曲・シナリオ", "count" : 1, "books" : [ "父帰る" ] }
*/